export const roadMotionPrompt =
  "第一张图片是车辆主体，第二张图片是目标道路动态参考图。请将第一张车自然放入第二张道路场景中，保持车辆真实车型、车身比例、车漆原色、轮毂、灯组、保持和原车拍摄角度一致，车身的镜面反射和场景一致，车身完整，轮胎和车顶不要裁切。营造真实道路行驶氛围、速度感、自然地面接触、轮胎阴影、车身环境反射和运动光影效果。严格参考第二张道路图的空间结构、地面材质、灯光方向和透视关系。不要人物、不要杂物、不要额外文字、不要车牌号，不要生成多辆车。横版16:9汽车电商主图，2K，真实汽车广告摄影。";

export const roadMotionWithLogoPrompt =
  "第一张图片是车辆主体，第二张图片是目标道路动态参考图，第三张图是贴在车牌处的参考图。请将第一张车自然放入第二张道路场景中，将第三张参考图中的标识添加至车牌位置，保持车辆真实车型、车身比例、车漆原色、轮毂、灯组、保持和原车拍摄角度一致，车身的镜面反射和场景一致，车身完整，轮胎和车顶不要裁切。营造真实道路行驶氛围、速度感、自然地面接触、轮胎阴影、车身环境反射和运动光影效果。严格参考第二张道路图的空间结构、地面材质、灯光方向和透视关系。不要人物、不要杂物、不要额外文字、不要车牌号，不要生成多辆车。横版16:9汽车电商主图，2K，真实汽车广告摄影。";

