export const skyStudioPrompt =
  "第一张图片是车辆主体，第二张图片是目标天空影棚参考图。请将第一张车自然放入第二张天空影棚场景中，保持车辆真实车型、车身比例、车漆原色、轮毂、灯组、保持和原车拍摄角度一致，车身的镜面反射和场景一致，车身完整，轮胎和车顶不要裁切。让天空、光照、地面反射、车身高光和环境氛围自然统一。严格参考第二张天空图的天空氛围、光线方向、空间结构和透视关系。不要人物、不要杂物、不要额外文字、不要车牌号，不要生成多辆车。横版16:9汽车电商主图，2K，真实汽车广告摄影。";

export const skyStudioWithLogoPrompt =
  "第一张图片是车辆主体，第二张图片是目标天空影棚参考图，第三张图是贴在车牌处的参考图。请将第一张车自然放入第二张天空影棚场景中，将第三张参考图中的标识添加至车牌位置，保持车辆真实车型、车身比例、车漆原色、轮毂、灯组、保持和原车拍摄角度一致，车身的镜面反射和场景一致，车身完整，轮胎和车顶不要裁切。让天空、光照、地面反射、车身高光和环境氛围自然统一。严格参考第二张天空图的天空氛围、光线方向、空间结构和透视关系。不要人物、不要杂物、不要额外文字、不要车牌号，不要生成多辆车。横版16:9汽车电商主图，2K，真实汽车广告摄影。";

